# 我觉得我爸爸说的对, 我过去也许一直准备说把林伟那几招搞定, 或许是一种逃避的表现.
# 说实话, 那几招你能确定 2 个月就能学会吗?
# 还是给自己一个逃避的理由, 不用面对工作的理由, 来面对你学习上的失败.
# 不管如何, 我都要去面对

* DONE [#B] 搞清楚面试流程 [50%]
DEADLINE: <2022-12-17 Sat 15:20> SCHEDULED: <2022-12-17 Sat>
:LOGBOOK:
CLOCK: [2022-12-17 Sat 14:37]--[2022-12-17 Sat 15:22] =>  0:45
:END:
- [-] 疑问
    - [X] 那个 app 找工作 / 应届生是否有专门的网站可以投
    - [X] 怎么分辨招实习还是正式
    - [ ] 怎么做简历
    - [X] 怎么投简历
    - [X] 怎么联系 hr

- [X] Boss 直聘面试流程
    - 找到实习
    - 联系 hr
    - Hr 看了你的电子简历, 感兴趣
    - 发送你的简历
    - 约定线上面试时间

     
* DONE [#B] 制作简历 [87%]
DEADLINE: <2022-12-17 Sat 16:30> SCHEDULED: <2022-12-17 Sat>
:LOGBOOK:
CLOCK: [2022-12-17 Sat 21:41]--[2022-12-17 Sat 22:49] =>  1:08
CLOCK: [2022-12-17 Sat 17:04]--[2022-12-17 Sat 18:12] =>  1:08
CLOCK: [2022-12-17 Sat 15:24]--[2022-12-17 Sat 16:30] =>  1:06
:END:

- [X] 用什么写 ? (docx?? 还是 app 的私有格式?)

  PDF, 或者 boss APP 生成
- [X] 应届生和实习生是一样的吗?
      
  不一样, 但是现在找实习生是浪费时间, 现在直接找应届生就好了
- [X] 有没有一套 "业界标准/通用" 的模板 

  妈的，真的按照这套模板写, 大多数人都是空白, 所以我要另辟绝境, 让 hr 看到什么是开源大佬

    - [X] 个人信息
    - [X] 个人优势(重点)
    - [X] 项目经历
    - [X] 教育经历
    - [X] 工作(实习)经历
    - [X] 个人评价: 
---------------          
- [X] 个人信息
            
- [X] 个人优势(重点)
    - [X] 对 linux 服务器编程和命令行，黑客文化非常感兴趣, 折腾过 emacs

    - [X] 熟悉异步事件和 socket, 擅长 linux 网络编程

    - [X] 熟悉 Linux 环境编程, 熟悉多线程, 同步机制

    - [X] 学习能力非常强, 大学全靠自学, 喜欢读源代码

    - [X] 熟悉 c++ 和 STL, 与 python 等动态语言

    - [X] 深入剖析过 nginx 源码, Libevent, Muduo 等后端网络库代码

    - [X] 使用 C++ 编写过很多 server 代码，如 ftp, Http, 聊天服务器等.

- [ ] 项目经历 [0%]

    - [ ] 用 c++ 从零实现 http Server, 实现并发量多少多少?

    - [ ] 还差点意思
      
- [X] 教育经历

  广东石油化工学院

  大一的时候跟随实验室老师做项目, 主要是 QT 的开发.

  后来发现自己喜欢的是 Linux 服务器开发, 自己更喜欢开发 server, 兴趣转移到高性能, 后端架构, 异步网络编程等研究上面.

  遂离开老师, 大学期间研究过很多开源项目, 把很多计算机的很多经典书籍都看了一遍, 写过很多代码.

- [X] 个人评价

  喜欢极客文化, 喜欢 linux, 命令行，Emacs 等很酷的东西.

  有着超强的自学能力, 对自己喜欢的事情有着无穷的探索热情.

  偶像是王勇, 因为他不会限制自己的想象力.
----------
就是差把项目经历给写上去, 但是我在短时间内, 怎么搞到项目经历呢???
----------

              
* LOOP [#B] 简历所需要的 github 项目 [%]
DEADLINE: <2022-12-22 Thu> SCHEDULED: <2022-12-20 Tue>
----


* LOOP [#B] 完善所有面试所需的知识点 [0%]
DEADLINE: <2022-12-24 Sat> SCHEDULED: <2022-12-17 Sat>
- [ ] 预习 [0%]
    - [ ] 会写算法, 其他都可以吹牛, 但是数据结构可是要实打实的手写的. 
    - [ ] 在哪里有面试题目
        - [ ] 牛客网
        - [ ] 剑指 offer
    - [ ] 快速复习以前学过的知识
        - [ ] 数据结构与算法
        - [ ] C++ 语法 / Python 语法 / GOlang 语法
        - [ ] 基础知识
            - [ ] 计算机网络
            - [ ] 体系结构
            - [ ] 操作系统
        - [ ] 一些经典的项目架构设计
            - [ ] Libevent
            - [ ] Muduo
            - [ ] Nginx
    - [ ] 自己写一个应用
- [ ] LOOP [0%]

  
* LOOP [#B] 找到工作与入职 [%]
DEADLINE: <2022-12-31 Sat> SCHEDULED: <2022-12-17 Sat>


* WAIT [#B] 巅峰春招 [%]
SCHEDULED: <2023-02-01 Wed> DEADLINE: <2023-03-01 Wed>

林伟的几个项目
